# для Вашего удобства словарь вида ""буква: код Морзе"" уже готов
d=morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',
           'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
           'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••', 
           'm': '——', 'n': '—•', 'o': '———', 'p': '•——•', 
           'q': '——•—', 'r': '•—•', 's': '•••', 't': '—', 
           'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
           'y': '—•——', 'z': '——••', 
           '1':'•————', '2':'••———', '3':'•••——',
           '4':'••••—','5':'•••••','6':'—••••',
           '7':'——•••','8':'———••','9':'————•','0':'—————'}
l={}
for i in d.keys():
    l[d.get(i)]=i
d.update(l)
a=input()
if ('•' or '—') in a:
    for i in a.split('\t'):
                print(*[d[j] if j in d else j for j in i.split()],end=' ',sep='')
    print(' ', end='')        
else:        
    for j in a.lower().split():
        print(*[d[i] if i in d else i for i in j],end='\t',sep=' ')




 