name = str(input())
a = ""Энрико Ферми""
b = ""Нильс Бор""
c = ""Джон фон Нейман""
d = ""Ричард Фейнман""
e = ""Роберт Оппенгеймер""
f = ""Ганс Бизе""
g = ""Ханс Бете""
if name == a:
    print(""Доступ разрешен"")
elif name == b:
    print(""Доступ разрешен"")
elif name == c:
    print(""Доступ разрешен"")
elif name == d:
    print(""Доступ разрешен"")
elif name == e:
    print(""Доступ разрешен"")
elif name == f:
    print(""Доступ разрешен"")
elif name == g:
    print(""Доступ разрешен"")
else:
    print(""Доступ запрещен"")
 