t = {}
for i in range(int(input())):
    l = input().split(';')
    if l[0] not in t:
        t[l[0]] = [0]*5   
    if l[2] not in t:
        t[l[2]] = [0]*5
    t[l[0]][0] += 1
    t[l[2]][0] += 1         #+Всего 0 0 0 0  
    if int(l[1]) > int(l[3]):
        t[l[0]][1] += 1      #Всего +Побед 0 0 0     
        t[l[2]][3] += 1      #Всего Побед Ничьих +Поражений 0     
        t[l[0]][4] += 3      #Всего Побед Ничьих Поражений +Очков
    elif int(l[1]) == int(l[3]):
        t[l[0]][2] += 1      #Всего Побед +Ничьих 0 0
        t[l[2]][2] += 1
        t[l[0]][4] += 1      #Всего Побед Ничьих Поражений +Очков
        t[l[2]][4] += 1
    else:
        t[l[2]][1] += 1      #Всего +Побед 0 0 0
        t[l[2]][4] += 3      #Всего Побед Ничьих Поражений +Очков
        t[l[0]][3] += 1      #Всего Побед Ничьих +Поражений 0     
for k in [[i] + [j for j in t[i]] for i in t]:          
    print(k[0]+':',*k[1:]) 